using CORE.Models;
using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Metadata.Builders;

namespace CORE.ModelsConfiguration
{
    public class IllnessesConfiguration : IEntityTypeConfiguration<Illness>
    {
        public void Configure(EntityTypeBuilder<Illness> builder)
        {
            builder.HasData(
                new
                {
                    Name = "Хвороба №1",
                    Symptoms = "Симптоми №1",
                    Procedures = "Розумний текст №1...",
                    HospitalUnitName = "Хірургічне відділення",
                },
                new
                {
                    Name = "Хвороба №2",
                    Symptoms = "Симптоми №2",
                    Procedures = "Розумний текст №2...",
                    HospitalUnitName = "Хірургічне відділення",
                },
                new
                {
                    Name = "Хвороба №3",
                    Symptoms = "Симптоми №3",
                    Procedures = "Розумний текст №3...",
                    HospitalUnitName = "Хірургічне відділення",
                },
                new
                {
                    Name = "Хвороба №4",
                    Symptoms = "Симптоми №4",
                    Procedures = "Розумний текст №4...",
                    HospitalUnitName = "Пульмонологічне відділення",
                },
                new
                {
                    Name = "Хвороба №5",
                    Symptoms = "Симптоми №5",
                    Procedures = "Розумний текст №5...",
                    HospitalUnitName = "Пульмонологічне відділення",
                },
                new
                {
                    Name = "Хвороба №6",
                    Symptoms = "Симптоми №6",
                    Procedures = "Розумний текст №6...",
                    HospitalUnitName = "Хірургічне відділення",
                },
                new
                {
                    Name = "Хвороба №7",
                    Symptoms = "Симптоми №7",
                    Procedures = "Розумний текст №7...",
                    HospitalUnitName = "Хірургічне відділення",
                },
                new
                {
                    Name = "Неробство",
                    Symptoms = "Хворий лежить у ліжку і нічого не хоче робити, встає з ліжка тільки аби задовольнити свої базові потреби. Спостерігається так званий синдром \"сім п'ятниць на тиждень\".",
                    Procedures = "Регулярне відвідування лекційних і практичних онлайн занять, що проводять викладачі Харківського національного університету радіоелектроніки у Google meet. Заняття слід відвідувати 5 разів на тиждень, кожного тиждня, протягом 9 місяців, за відсутності особливих вказівок деканату ХНУРЕ.",
                    HospitalUnitName = "Хірургічне відділення",
                },
                new
                {
                    Name = "Нудьга",
                    Symptoms = "У хворого спостерігається прагнення відмовитися від подолання труднощів, найвне стійке небажання робити вольове зусилля. В особливо важких випадках, хворий періодично плює у стелі, поки лежить або сидить, і чекає падіння слини.",
                    Procedures = "Регулярне відвідування лекційних і практичних онлайн занять, що проводять викладачі Харківського національного університету радіоелектроніки у Google meet. Заняття слід відвідувати 5 разів на тиждень, кожного тиждня, протягом 9 місяців, за відсутності особливих вказівок деканату ХНУРЕ. Задля покращення ефекту від лікування слід також приймати участь у конференціях, студенських олімпіадах чи іншою студентською активністю.",
                    HospitalUnitName = "Хірургічне відділення",
                }
            );
        }
    }
}